tap "coursier/formulas"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "saulpw/vd"
tap "thoughtbot/formulae"
tap "warrensbox/tap"
tap "withgraphite/tap"
# C++ Common Libraries
brew "abseil"
# Run your GitHub Actions locally
brew "act"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Library and utilities for processing GIFs
brew "giflib"
# Performance-portable, length-agnostic SIMD with runtime dispatch
brew "highway"
# Library of 2D and 3D vector, matrix, and math operations
brew "imath"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library for manipulating PNG images
brew "libpng"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# High dynamic-range image file format
brew "openexr"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# AWS SDK for C++
brew "aws-sdk-cpp"
# Asynchronous DNS library
brew "c-ares"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Next generation open source RPC library and framework
brew "grpc"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# High-performance theorem prover
brew "z3"
# Next-gen compiler infrastructure
brew "llvm"
# Compression/decompression library aiming for high speed
brew "snappy"
# Framework for scalable cross-language services development
brew "thrift"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# C library implementing the SSH2 protocol
brew "libssh2"
# Download with resuming and segmented downloading
brew "aria2"
# Library for ARIB STD-B24, decoding JIS 8 bit characters and parsing MPEG-TS
brew "aribb24"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Record and share terminal sessions
brew "asciinema"
# Portable library for importing many well-known 3D model formats
brew "assimp"
# Archival front-end
brew "atool"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2@1.7"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision numeric processing language
brew "bc"
# High performance key/value database
brew "berkeley-db", link: true
# High performance key/value database
brew "berkeley-db@5"
# Greps through binaries from various OSs and architectures
brew "bingrep"
# GNU binary tools for native development
brew "binutils"
# Python code formatter
brew "black"
# Collection of portable C++ source libraries
brew "boost"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# New way to see and navigate directory trees
brew "broot"
# Freely available high-quality data compressor
brew "bzip2"
# Glorious Glasgow Haskell Compilation System
brew "ghc"
# Command-line interface for Cabal and Hackage
brew "cabal-install"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# C string library for manipulating Unicode strings
brew "libunistring"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# X.Org: Library for the Render Extension to the X11 protocol
brew "libxrender"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Insanely fast image printing in your terminal
brew "catimg"
# Mozilla CA bundle for Python
brew "certifi"
# C access to FITS data files with optional Fortran wrappers
brew "cfitsio"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Linter/analyzer for Makefiles
brew "checkmake"
# Ultralightweight JSON parser in ANSI C
brew "cjson"
# Fix common misspellings in source code and text files
brew "codespell"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils", link: false
# Top-like interface for container metrics
brew "ctop"
# HTTP/2 C Library
brew "libnghttp2"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Tools to manipulate dates with a focus on financial data
brew "dateutils"
# AV1 decoder targeted to be small and fast
brew "dav1d"
# Message bus system, providing inter-application communication
brew "dbus"
# YAML Parser
brew "libyaml"
# Enterprise friendly way of detecting and preventing secrets in code
brew "detect-secrets"
# Utility to replace problematic characters in filenames
brew "detox"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Platform-neutral API for system-level and libc-like functions
brew "nspr"
# Libraries for security-enabled client and server applications
brew "nss"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Visually compare two PDF files
brew "diff-pdf"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Tools for browsing and manipulating docker registries
brew "docker-ls"
# Text processing system for reStructuredText
brew "docutils"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Binary-decimal and decimal-binary routines for IEEE doubles
brew "double-conversion"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Open-source formatting library for C++
brew "fmt"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# NaCl networking and cryptography library
brew "libsodium"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# QUIC transport protocol implementation
brew "mvfst"
# Modular, composable client/server abstractions framework
brew "wangle"
# Extremely fast non-cryptographic hash algorithm
brew "xxhash"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Tool to verify that your files are in harmony with your .editorconfig
brew "editorconfig-checker"
# Library like getopt(3) with a number of enhancements
brew "popt"
# Powerful wavelet image compressor
brew "epsilon"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# EXIF parsing library
brew "libexif"
# Read, write, modify, and display EXIF data on the command-line
brew "exif"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# XML 1.0 parser
brew "expat"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Minimalistic plugin API for video effects
brew "frei0r"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Image processing and image analysis library
brew "leptonica"
# Secure hashing function
brew "libb2"
# Multi-format archive and compression library
brew "libarchive"
# Implementation of the Unicode line- and word-breaking algorithms
brew "libunibreak"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Cryptographic & SSL/TLS library
brew "mbedtls"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Vorbis General Audio Compression Codec
brew "libvorbis"
# MP3 player for Linux and UNIX
brew "mpg123"
# Audio codec
brew "opus"
# C library for files containing sampled sound
brew "libsndfile"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Transcode video stabilization plugin
brew "libvidstab"
# VP8/VP9 video codec
brew "libvpx"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Fastest and safest AV1 video encoder
brew "rav1e"
# Audio time stretcher tool and library
brew "rubberband"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Audio codec designed for speech
brew "speex"
# Secure Reliable Transport
brew "srt"
# AV1 encoder
brew "svt-av1"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Open video compression format
brew "theora"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# High-performance, asynchronous messaging library
brew "zeromq"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Fast web fuzzer written in Go
brew "ffuf"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Text-based UI library
brew "ncurses"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Lint your Python code for style and logical errors
brew "flake8"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Scriptable ping program for checking if multiple hosts are up
brew "fping"
# CLI program that accepts piped input and presents files for selection
brew "fpp"
# C library for zip/unzip via zLib
brew "minizip"
# Library to extract data from Excel .xls files
brew "freexl"
# Command-line fuzzy finder written in Go
brew "fzf"
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "fzy"
# C library for multiple-precision floating-point computations
brew "mpfr"
# GNU awk utility
brew "gawk"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# Geometry Engine
brew "geos"
# Adaptive Entropy Coding implementing Golomb-Rice algorithm
brew "libaec"
# Manage compile and link flags for libraries
brew "pkg-config"
# File format designed to store large amounts of data
brew "hdf5"
# JSON parser for C
brew "json-c"
# Network authentication protocol
brew "krb5"
# Open h.265 video codec implementation
brew "libde265"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# URI parsing library (strictly RFC 3986 compliant)
brew "uriparser"
# Library to parse, generate and operate on KML
brew "libkml"
# Ersi LERC library (Limited Error Raster Compression)
brew "liblerc"
# Postgres C API library
brew "libpq"
# RT Topology Library
brew "librttopo"
# GNOME XML library
brew "libxml2"
# Adds spatial SQL capabilities to SQLite
brew "libspatialite"
# Generic library support script
brew "libtool"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Computes convex hulls in n dimensions
brew "qhull"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Validating XML parser
brew "xerces-c"
# Geospatial Data Abstraction Library
brew "gdal"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# International domain name library
brew "libidn"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Audit git repos for secrets
brew "gitleaks"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simple jira command-line client in Go
brew "go-jira"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for manipulating JPEG-2000 images
brew "jasper"
# Image processing tools collection
brew "graphicsmagick"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line tool for generating regular expressions
brew "grex"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Kubernetes package manager
brew "helm"
# Command-line hex viewer
brew "hexyl"
# Library for communicating with USB and Bluetooth HID devices
brew "hidapi"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Spell checker and morphological analyzer
brew "hunspell"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to monitor I/O latency in real time
brew "ioping"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for JSON, based on GLib
brew "json-glib"
# Library for interacting with JSON
brew "jsoncpp"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Selection-based modal text editor
brew "kakoune"
# Easy way to access the system keyring service from python
brew "keyring"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# DNS library written in C
brew "ldns"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Terminal file manager
brew "lf"
# Assuan IPC Library
brew "libassuan@2"
# CBOR protocol implementation for C and others
brew "libcbor"
# Framework for scientific data networking
brew "libdap"
# Asynchronous event library
brew "libev"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Library for large linear classification
brew "liblinear"
# Library for parsing mms:// and mmsh:// network streams
brew "libmms"
# Shared library for libmediainfo
brew "libzen"
# Shared library for mediainfo
brew "libmediainfo"
# C and C++ client library to the memcached server
brew "libmemcached"
# MNG/JNG reference library
brew "libmng"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Portable library for network traffic capture
brew "libpcap"
# X.Org: pthread-stubs.pc
brew "libpthread-stubs"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Library for scrypt
brew "libscrypt"
# Very basic terminfo library
brew "unibilium"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Bare libuv bindings for lua
brew "luv"
# Security and system auditing tool to harden systems
brew "lynis"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# C Markdown parser. Fast. SAX-like interface
brew "md4c"
# Recursively compute digests on files/directories
brew "md5deep"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Tool for working with usage-spec CLIs
brew "usage"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Multiple Repository management tool
brew "mr"
# Library for a binary-based efficient data interchange format
brew "msgpack"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Experimental optional static type checker for Python
brew "mypy"
# Virtual environments for Node.js
brew "nave"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Convert OpenDocument files to plain text
brew "odt2txt"
# Open source suite of directory software
brew "openldap"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Light-weight C++ XML processing library
brew "pugixml"
# Rich and complete approach to parallelism in C++
brew "tbb"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Simplistic interactive filtering tool
brew "peco"
# Highly capable, feature-rich programming language
brew "perl"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Modern replacement for ps written in Rust
brew "procs"
# Coreutils progress viewer
brew "progress"
# Linter for prose
brew "proselint"
# Unix pager optimized for psql
brew "pspg"
# Show ps output as a tree
brew "pstree"
# Command-line tool for managing long-running shell commands
brew "pueue"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# QR Code generation
brew "qrencode"
# Cross-platform application and UI framework
brew "qt@5"
# JSON parser/generator for C++ with SAX and DOM style APIs
brew "rapidjson"
# RC file (dotfile) management
brew "rcm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Rootkit hunter
brew "rkhunter"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Blazing-fast modern Lua linter
brew "selene"
# Easily detect and prevent bugs and anti-patterns in your codebase
brew "semgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Bash syntax highlighter that encourages/fixes variables quoting
brew "shellharden"
# Autoformat shell script source code
brew "shfmt"
# Tool Command Language
brew "tcl-tk"
# Command-line packet analyzer
brew "tcpdump"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Anonymizing overlay network for TCP
brew "tor"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# CLI tool that moves files or folder to the trash
brew "trash"
# Tree command, improved
brew "tre-command"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Utilities for interacting with PyPI
brew "twine"
# Extraction utility for .zip compressed archives
brew "unzip"
# Cross-platform Rust rewrite of the GNU coreutils
brew "uutils-coreutils"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Lookup tool for domain names and other internet resources
brew "whois"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Userspace Go implementation of WireGuard
brew "wireguard-go"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# CLI to convert between YAML, TOML, JSON and HCL
brew "yj"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Compression and file packaging/archive utility
brew "zip"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Launcher for Coursier
brew "coursier/formulas/coursier"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# The tgswitch command lets you switch between terragrunt versions.
brew "warrensbox/tap/tgswitch"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Securely stores and accesses AWS credentials in a development environment
cask "aws-vault"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# All-in-one toolbox for developers
cask "devutils"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-nova-mono"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@canary"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Open-source keystroke visualiser
cask "keycastr"
# Link-Layer MAC spoofing GUI for macOS
cask "linkliar"
# Host-based application firewall
cask "little-snitch"
# File system integration
cask "macfuse"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Web browser
cask "safari-technology-preview"
# Additional features and controls for Shure MV7 and MV88+ microphones
cask "shureplus-motiv"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Control your Sonos system
cask "sonos"
# Data visualization software
cask "tableau"
# Native GUI tool for relational databases
cask "tableplus"
# Mesh VPN based on WireGuard
cask "tailscale"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@11"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Disk encryption software focusing on security based on TrueCrypt
cask "veracrypt"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "bierner.markdown-emoji"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "databricks.databricks"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dorzey.vscode-sqlfluff"
vscode "dotenv.dotenv-vscode"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "graphite.gti-vscode"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "iterative.dvc"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "sygene.auto-correct"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "ypresto.vscode-accelerated"
vscode "yzhang.markdown-all-in-one"
