tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'saulpw/vd'
tap 'thoughtbot/formulae'
tap 'universal-ctags/universal-ctags'
tap 'warrensbox/tap'
# Run your GitHub Actions locally 🚀
brew 'act'
# Library for command-line editing
brew 'readline'
# General-purpose data compression with high compression ratio
brew 'xz'
# Automate deployment, configuration, and upgrading
brew 'ansible'
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew 'antigen'
# GNU compiler collection
brew 'gcc'
# Library for processing command-line flags
brew 'gflags'
# Package for scientific computing with Python
brew 'numpy'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.9'
# Columnar in-memory analytics layer designed to accelerate big data
brew 'apache-arrow'
# Download with resuming and segmented downloading
brew 'aria2'
# Record and share terminal sessions
brew 'asciinema'
# Archival front-end
brew 'atool'
# Official Amazon AWS command-line interface
brew 'awscli'
# Programmable completion for Bash 4.2+
brew 'bash-completion@2'
# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'
# Arbitrary precision numeric processing language
brew 'bc'
# High performance key/value database
brew 'berkeley-db', link: true
# Greps through binaries from various OSs and architectures
brew 'bingrep'
# GNU binary tools for native development
brew 'binutils'
# Python code formatter
brew 'black'
# Freely available high-quality data compressor
brew 'bzip2'
# Glorious Glasgow Haskell Compilation System
brew 'ghc'
# Command-line interface for Cabal and Hackage
brew 'cabal-install'
# Core application library for C
brew 'glib'
# Insanely fast image printing in your terminal
brew 'catimg'
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew 'libheif'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew 'chafa'
# Checks for bashisms in shell scripts
brew 'checkbashisms'
# Color-highlighted diff(1) output
brew 'colordiff'
# GNU File, Shell, and Text utilities
brew 'coreutils'
# Top-like interface for container metrics
brew 'ctop'
# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'
# Tools to manipulate dates with a focus on financial data
brew 'dateutils'
# Open source programming language to build simple/reliable/efficient software
brew 'go'
# Go dependency management tool
brew 'dep'
# Enterprise friendly way of detecting and preventing secrets in code
brew 'detect-secrets'
# Utility to replace problematic characters in filenames
brew 'detox'
# Good-lookin' diffs with diff-highlight and more
brew 'diff-so-fancy'
# File comparison utilities
brew 'diffutils'
# Load/unload environment variables based on $PWD
brew 'direnv'
# Tools for browsing and manipulating docker registries
brew 'docker-ls'
# Text processing system for reStructuredText
brew 'docutils'
# Convert text between DOS, UNIX, and Mac formats
brew 'dos2unix'
# Select default apps for documents and URL schemes on macOS
brew 'duti'
# Maintain consistent coding style between multiple editors
brew 'editorconfig'
# Platform built on V8 to build network applications
brew 'node'
# AST-based pattern checker for JavaScript
brew 'eslint'
# Modern replacement for 'ls'
brew 'exa'
# Read, write, modify, and display EXIF data on the command-line
brew 'exif'
# Perl lib for reading and writing EXIF metadata
brew 'exiftool'
# Collection of reusable C++ library artifacts developed at Facebook
brew 'folly'
# C++14 implementation of the TLS-1.3 standard
brew 'fizz'
# Modular, composable client/server abstractions framework
brew 'wangle'
# Facebook's branch of Apache Thrift, including a new C++ server
brew 'fbthrift'
# Thrift functions for querying information from a service
brew 'fb303'
# Simple, fast and user-friendly alternative to find
brew 'fd'
# Generate introspection data for GObject libraries
brew 'gobject-introspection'
# OpenType text shaping engine
brew 'harfbuzz'
# Play, record, convert, and stream audio and video
brew 'ffmpeg'
# Fast web fuzzer written in Go
brew 'ffuf'
# Banner-like program prints strings as ASCII art
brew 'figlet'
# Collection of GNU find, xargs, and locate
brew 'findutils'
# User-friendly command-line shell for UNIX-like operating systems
brew 'fish'
# Lint your Python code for style and logical errors
brew 'flake8'
# Infamous electronic fortune-cookie generator
brew 'fortune'
# Scriptable ping program for checking if multiple hosts are up
brew 'fping'
# CLI program that accepts piped input and presents files for selection
brew 'fpp'
# Command-line fuzzy finder written in Go
brew 'fzf'
# Fast, simple fuzzy text selector with an advanced scoring algorithm
brew 'fzy'
# GNU awk utility
brew 'gawk'
# Geometry Engine
brew 'geos'
# Framework for scientific data networking
brew 'libdap'
# Geospatial Data Abstraction Library
brew 'gdal'
# Toolkit for image loading and pixel buffer manipulation
brew 'gdk-pixbuf'
# GitHub command-line tool
brew 'gh'
# Distributed revision control system
brew 'git'
# Syntax-highlighting pager for git and diff output
brew 'git-delta'
# Small git utilities
brew 'git-extras'
# Quickly rewrite git repository history
brew 'git-filter-repo'
# Simple and efficient way to access statistics in git
brew 'git-quick-stats'
# Audit git repos for secrets
brew 'gitleaks'
# Alternative to top/htop
brew 'glances'
# GNU implementation of the famous stream editor
brew 'gnu-sed'
# GNU version of the tar archiving utility
brew 'gnu-tar'
# Library for USB device access
brew 'libusb'
# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'
# Simple jira command-line client in Go
brew 'go-jira'
# Library access to GnuPG
brew 'gpgme'
# Image processing tools collection
brew 'graphicsmagick'
# Framework for layout and rendering of i18n text
brew 'pango'
# Library to render SVG files using Cairo
brew 'librsvg'
# Graph visualization software from AT&T and Bell Labs
brew 'graphviz'
# GNU grep, egrep and fgrep
brew 'grep'
# Smarter Dockerfile linter to validate best practices
brew 'hadolint'
# Open-source video transcoder available for Linux, Mac, and Windows
brew 'handbrake'
# Kubernetes package manager
brew 'helm'
# Command-line hex viewer
brew 'hexyl'
# Convert source code to formatted text with syntax highlighting
brew 'highlight'
# Command-line tools for OpenPGP-related operations
brew 'hopenpgp-tools'
# Improved top (interactive process viewer)
brew 'htop'
# User-friendly cURL replacement (command-line HTTP client)
brew 'httpie'
# Curl statistics made simple
brew 'httpstat'
# Add GitHub support to git on the command-line
brew 'hub'
# Command-line benchmarking tool
brew 'hyperfine'
# Tool to monitor I/O latency in real time
brew 'ioping'
# Calculate various network masks, etc. from a given IP address
brew 'ipcalc'
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew 'iperf3'
# Interactive computing in Python
brew 'ipython'
# Lightweight and flexible command-line JSON processor
brew 'jq'
# JSON parser and validator with a CLI
brew 'jsonlint'
# Modern load testing tool, using Go and JavaScript
brew 'k6'
# Selection-based modal text editor
brew 'kakoune'
# Kubernetes command-line interface
brew 'kubernetes-cli'
# Lazier way to manage everything docker
brew 'lazydocker'
# DNS library written in C
brew 'ldns'
# Pager program similar to more
brew 'less'
# Input filter for the pager less
brew 'lesspipe'
# Terminal file manager
brew 'lf'
# C and C++ client library to the memcached server
brew 'libmemcached'
# Host-side of the Universal 2nd Factor (U2F) protocol
brew 'libu2f-host'
# C library for manipulating Yubico one-time passwords
brew 'libyubikey'
# Curses-based tool for viewing and analyzing log files
brew 'lnav'
# Security and system auditing tool to harden systems
brew 'lynis'
# Mac App Store command-line interface
brew 'mas'
# Recursively compute digests on files/directories
brew 'md5deep'
# Unified display of technical and tag data for audio/video
brew 'media-info'
# Scalable distributed version control system
brew 'mercurial'
# Simple tool to make locally trusted development certificates
brew 'mkcert'
# Collection of tools that nobody wrote when UNIX was young
brew 'moreutils'
# Remote terminal application
brew 'mosh'
# 'traceroute' and 'ping' in a single tool
brew 'mtr'
# Tail multiple files in one terminal simultaneously
brew 'multitail'
# CLI for MySQL with auto-completion and syntax highlighting
brew 'mycli'
# Virtual environments for Node.js
brew 'nave'
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# HTTP/2 C Library
brew 'nghttp2'
# Port scanning utility for large networks
brew 'nmap'
# Convert OpenDocument files to plain text
brew 'odt2txt'
# OpenBSD freely-licensed SSH connectivity tools
brew 'openssh'
# Cryptography and SSL/TLS Toolkit
brew 'openssl@3'
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew 'openvpn'
# 7-Zip (high compression file archiver) implementation
brew 'p7zip'
# Swiss-army knife of markup format conversion
brew 'pandoc'
# Simplistic interactive filtering tool
brew 'peco'
# CLI for Postgres with auto-completion and syntax highlighting
brew 'pgcli'
# Display the PID number for a given process name
brew 'pidof'
# Pinentry for GPG on Mac
brew 'pinentry-mac'
# Execute binaries from Python packages in isolated environments
brew 'pipx'
# Cross-platform application and UI framework
brew 'qt'
# PDF rendering library (based on the xpdf-3.0 code base)
brew 'poppler'
# Object-relational database system
brew 'postgresql', restart_service: true
# Framework for managing multi-language pre-commit hooks
brew 'pre-commit'
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew 'prettier'
# Modern replacement for ps written by Rust
brew 'procs'
# Coreutils progress viewer
brew 'progress'
# Linter for prose
brew 'proselint'
# Unix pager optimized for psql
brew 'pspg'
# Show ps output as a tree
brew 'pstree'
# Python version management
brew 'pyenv'
# Pyenv plugin to manage virtualenv
brew 'pyenv-virtualenv'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.8'
# QR Code generation
brew 'qrencode'
# File browser
brew 'ranger'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Wrapper around ripgrep that adds multiple rich file types
brew 'ripgrep-all'
# Rootkit hunter
brew 'rkhunter'
# Extremely fast tool to remove dupes and other lint from your filesystem
brew 'rmlint'
# Utility that provides fast incremental file transfer
brew 'rsync'
# Safe, concurrent, practical language
brew 'rust'
# Static analysis and lint tool, for (ba)sh scripts
brew 'shellcheck'
# Bash syntax highlighter that encourages/fixes variables quoting
brew 'shellharden'
# Autoformat shell script source code
brew 'shfmt'
# IPv4/IPv6 subnet calculator
brew 'subnetcalc'
# Command-line packet analyzer
brew 'tcpdump'
# Very fast implementation of tldr in Rust
brew 'tealdeer'
# Send macOS User Notifications from the command-line
brew 'terminal-notifier'
# CLI tool to generate terraform files from existing infrastructure
brew 'terraformer'
# Terraform version manager inspired by rbenv
brew 'tfenv'
# Linter for Terraform files
brew 'tflint'
# Code-search similar to ack
brew 'the_silver_searcher'
# Granddaddy of HTML tools, with support for modern standards
brew 'tidy-html5'
# Text interface for Git repositories
brew 'tig'
# Terminal multiplexer
brew 'tmux'
# Ultimate terminal divider powered by tmux
brew 'tmux-xpanes'
# Program that allows you to count code, quickly
brew 'tokei'
# Anonymizing overlay network for TCP
brew 'tor', restart_service: true
# Toolkit for localization engineers
brew 'translate-toolkit'
# CLI tool that moves files or folder to the trash
brew 'trash'
# Display directories as trees (with optional color/HTML output)
brew 'tree'
# Utilities for interacting with PyPI
brew 'twine-pypi'
# Extraction utility for .zip compressed archives
brew 'unzip'
# Vi 'workalike' with many additional features
brew 'vim'
# Executes a program periodically, showing output fullscreen
brew 'watch'
# Watch files and take action when they change
brew 'watchman'
# Internet file retriever
brew 'wget'
# Lookup tool for domain names and other internet resources
brew 'whois'
# Userspace Go implementation of WireGuard
brew 'wireguard-go'
# Tools for the WireGuard secure network tunnel
brew 'wireguard-tools'
# Fast CSV toolkit written in Rust
brew 'xsv'
# Linter for YAML files
brew 'yamllint'
# CLI to convert between YAML, TOML, JSON and HCL
brew 'yj'
# YubiKey personalization library and tool
brew 'ykpers'
# Download YouTube videos from the command-line
brew 'youtube-dl'
# Process YAML documents from the CLI
brew 'yq'
# Compression and file packaging/archive utility
brew 'zip'
# General-purpose lossless data-compression library
brew 'zlib'
# Shell extension to navigate your filesystem faster
brew 'zoxide'
# UNIX shell (command interpreter)
brew 'zsh'
# Additional completion definitions for zsh
brew 'zsh-completions'
# Everything you need to get started with Heroku
brew 'heroku/brew/heroku'
# Terminal utility for exploring and arranging tabular data
brew 'saulpw/vd/visidata'
# management suite for dotfiles
brew 'thoughtbot/formulae/rcm'
# Maintained ctags implementation
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
# The tfswitch command lets you switch between terraform versions.
brew 'warrensbox/tap/tfswitch'
# Password manager that keeps all passwords secure behind one password
cask '1password'
# Command-line helper for the 1Password password manager
cask '1password-cli'
# JDK from the Java User Group (JUG)
cask 'adoptopenjdk'
# Application launcher and productivity software
cask 'alfred'
# Enable Windows-like alt-tab
cask 'alt-tab'
# Tools for building Android applications
cask 'android-studio'
# Application uninstaller
cask 'appcleaner'
# Securely stores and accesses AWS credentials in a development environment
cask 'aws-vault'
# Tool to flash OS images to SD cards & USB drives
cask 'balenaetcher'
# Menu bar icon organizer
cask 'bartender'
# API documentation browser and code snippet manager
cask 'dash'
# Offline toolbox for developers
cask 'devutils'
# App to build and share containerized applications and microservices
cask 'docker'
# Web browser
cask 'firefox'
# Web browser
cask 'firefox-developer-edition'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
# Web browser
cask 'google-chrome'
# Web browser
cask 'google-chrome-canary'
# Set of tools to manage resources and applications hosted on Google Cloud
cask 'google-cloud-sdk'
# System monitoring app
cask 'istat-menus'
# Terminal emulator as alternative to Apple's Terminal app
cask 'iterm2'
# Keyboard customizer
cask 'karabiner-elements'
# Open-source keystroke visualizer
cask 'keycastr'
# Office suite
cask 'libreoffice'
# Link-Layer MAC spoofing GUI for macOS
cask 'linkliar'
# Host-based application firewall
cask 'little-snitch'
# File system integration
cask 'macfuse'
# Monitors and reports any microphone and camera activity
cask 'micro-snitch'
# Silence embarrassing notifications while screensharing
cask 'muzzle'
# Knowledge base that works on top of a local folder of plain text Markdown files
cask 'obsidian'
# Retro video game emulation
cask 'openemu'
# Free and open source web app scanner
cask 'owasp-zap'
# Move and resize windows using keyboard shortcuts or snap areas
cask 'rectangle'
# Web browser
cask 'safari-technology-preview'
# Additional features and controls for Shure MV7 and MV88+ microphones
cask 'shureplus-motiv'
# Instant messaging application focusing on security
cask 'signal'
# Team communication and collaboration software
cask 'slack'
# Displays all open files and sockets in use by all running processes
cask 'sloth'
# Control your Sonos system
cask 'sonos'
# Data visualization software
cask 'tableau'
# Native GUI tool for relational databases
cask 'tableplus'
# JDK from the Eclipse Foundation (Adoptium)
cask 'temurin8'
# Free and open-source OpenVPN client
cask 'tunnelblick'
# Disk encryption software focusing on security based on TrueCrypt
cask 'veracrypt'
# Open-source code editor
cask 'visual-studio-code'
# Multimedia player
cask 'vlc'
# Desktop client for WhatsApp
cask 'whatsapp'
# Network protocol analyzer
cask 'wireshark'
# Video communication and virtual meeting platform
cask 'zoom'
